femat7/shockTube_tuto/shockTube_1000/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication setFields
runApplication $application
runApplication -s sample  postProcess -func sample

#------------------------------------------------------------------------------
